In [1]:
pip install scikit-learn matplotlib

Requirement already satisfied: scikit-learn in c:\users\shyam\appdata\local\programs\python\python39\lib\site-packages (1.6.1)
Requirement already satisfied: matplotlib in c:\users\shyam\appdata\local\programs\python\python39\lib\site-packages (3.6.2)
Requirement already satisfied: scipy>=1.6.0 in c:\users\shyam\appdata\local\programs\python\python39\lib\site-packages (from scikit-learn) (1.9.3)
Requirement already satisfied: joblib>=1.2.0 in c:\users\shyam\appdata\local\programs\python\python39\lib\site-packages (from scikit-learn) (1.4.2)
Requirement already satisfied: threadpoolctl>=3.1.0 in c:\users\shyam\appdata\local\programs\python\python39\lib\site-packages (from scikit-learn) (3.6.0)
Requirement already satisfied: numpy>=1.19.5 in c:\users\shyam\appdata\local\programs\python\python39\lib\site-packages (from scikit-learn) (1.22.2)
Requirement already satisfied: contourpy>=1.0.1 in c:\users\shyam\appdata\local\programs\python\python39\lib\site-packages (from matplotlib) (1.0.6)
Requirement already satisfied: fonttools>=4.22.0 in c:\users\shyam\appdata\local\programs\python\python39\lib\site-packages (from matplotlib) (4.38.0)
Requirement already satisfied: pillow>=6.2.0 in c:\users\shyam\appdata\local\programs\python\python39\lib\site-packages (from matplotlib) (9.3.0)
Requirement already satisfied: cycler>=0.10 in c:\users\shyam\appdata\local\programs\python\python39\lib\site-packages (from matplotlib) (0.11.0)
Requirement already satisfied: pyparsing>=2.2.1 in c:\users\shyam\appdata\local\programs\python\python39\lib\site-packages (from matplotlib) (3.0.7)
Requirement already satisfied: python-dateutil>=2.7 in c:\users\shyam\appdata\local\programs\python\python39\lib\site-packages (from matplotlib) (2.8.2)
Requirement already satisfied: kiwisolver>=1.0.1 in c:\users\shyam\appdata\local\programs\python\python39\lib\site-packages (from matplotlib) (1.4.4)
Requirement already satisfied: packaging>=20.0 in c:\users\shyam\appdata\local\programs\python\python39\lib\site-packages (from matplotlib) (24.2)
Requirement already satisfied: six>=1.5 in c:\users\shyam\appdata\local\programs\python\python39\lib\site-packages (from python-dateutil>=2.7->matplotlib) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

WARNING: You are using pip version 21.2.3; however, version 25.0.1 is available.
You should consider upgrading via the 'C:\Users\shyam\AppData\Local\Programs\Python\Python39\python.exe -m pip install --upgrade pip' command.

In [2]:
import pandas as pd

In [3]:
from sklearn.datasets import fetch_california_housing

In [47]:
df = fetch_california_housing(as_frame=True).frame

In [48]:
df

       MedInc  HouseAge  ...  Longitude  MedHouseVal
0      8.3252      41.0  ...    -122.23        4.526
1      8.3014      21.0  ...    -122.22        3.585
2      7.2574      52.0  ...    -122.24        3.521
3      5.6431      52.0  ...    -122.25        3.413
4      3.8462      52.0  ...    -122.25        3.422
...       ...       ...  ...        ...          ...
20635  1.5603      25.0  ...    -121.09        0.781
20636  2.5568      18.0  ...    -121.21        0.771
20637  1.7000      17.0  ...    -121.22        0.923
20638  1.8672      18.0  ...    -121.32        0.847
20639  2.3886      16.0  ...    -121.24        0.894

[20640 rows x 9 columns]

In [49]:
df.head(5)    # first 5 rows

   MedInc  HouseAge  ...  Longitude  MedHouseVal
0  8.3252      41.0  ...    -122.23        4.526
1  8.3014      21.0  ...    -122.22        3.585
2  7.2574      52.0  ...    -122.24        3.521
3  5.6431      52.0  ...    -122.25        3.413
4  3.8462      52.0  ...    -122.25        3.422

[5 rows x 9 columns]

In [50]:
df.tail(5)     # last 5 rows

       MedInc  HouseAge  ...  Longitude  MedHouseVal
20635  1.5603      25.0  ...    -121.09        0.781
20636  2.5568      18.0  ...    -121.21        0.771
20637  1.7000      17.0  ...    -121.22        0.923
20638  1.8672      18.0  ...    -121.32        0.847
20639  2.3886      16.0  ...    -121.24        0.894

[5 rows x 9 columns]

In [51]:
df.sample()    # picks random rows

       MedInc  HouseAge  ...  Longitude  MedHouseVal
12869  3.9318       7.0  ...    -121.38         1.33

[1 rows x 9 columns]

In [52]:
df.columns    #display all column names

Index(['MedInc', 'HouseAge', 'AveRooms', 'AveBedrms', 'Population', 'AveOccup',
       'Latitude', 'Longitude', 'MedHouseVal'],
      dtype='object')

In [53]:
pd.options.display.max_columns = 5

In [54]:
df

       MedInc  HouseAge  ...  Longitude  MedHouseVal
0      8.3252      41.0  ...    -122.23        4.526
1      8.3014      21.0  ...    -122.22        3.585
2      7.2574      52.0  ...    -122.24        3.521
3      5.6431      52.0  ...    -122.25        3.413
4      3.8462      52.0  ...    -122.25        3.422
...       ...       ...  ...        ...          ...
20635  1.5603      25.0  ...    -121.09        0.781
20636  2.5568      18.0  ...    -121.21        0.771
20637  1.7000      17.0  ...    -121.22        0.923
20638  1.8672      18.0  ...    -121.32        0.847
20639  2.3886      16.0  ...    -121.24        0.894

[20640 rows x 9 columns]

In [55]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20640 entries, 0 to 20639
Data columns (total 9 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   MedInc       20640 non-null  float64
 1   HouseAge     20640 non-null  float64
 2   AveRooms     20640 non-null  float64
 3   AveBedrms    20640 non-null  float64
 4   Population   20640 non-null  float64
 5   AveOccup     20640 non-null  float64
 6   Latitude     20640 non-null  float64
 7   Longitude    20640 non-null  float64
 8   MedHouseVal  20640 non-null  float64
dtypes: float64(9)
memory usage: 1.4 MB

In [57]:
# to describe table count, mean, min, max....
df.describe()

             MedInc      HouseAge  ...     Longitude   MedHouseVal
count  20640.000000  20640.000000  ...  20640.000000  20640.000000
mean       3.870671     28.639486  ...   -119.569704      2.068558
std        1.899822     12.585558  ...      2.003532      1.153956
min        0.499900      1.000000  ...   -124.350000      0.149990
25%        2.563400     18.000000  ...   -121.800000      1.196000
50%        3.534800     29.000000  ...   -118.490000      1.797000
75%        4.743250     37.000000  ...   -118.010000      2.647250
max       15.000100     52.000000  ...   -114.310000      5.000010

[8 rows x 9 columns]

In [59]:
df['MedInc']

0        8.3252
1        8.3014
2        7.2574
3        5.6431
4        3.8462
          ...
20635    1.5603
20636    2.5568
20637    1.7000
20638    1.8672
20639    2.3886
Name: MedInc, Length: 20640, dtype: float64

In [60]:
df['MedInc'].mean()   #df['MedInc'].min() or max() or count() or sum()

3.8706710029069766

In [61]:
df = pd.DataFrame({
    'name': ['shyam', 'ram', 'ravi', 'raj'],
    'age' : [25, 25, 30, 32],
    'job' : ['develope', 'developer', 'clerk', 'designer']    
})

In [62]:
df

    name  age        job
0  shyam   25   develope
1    ram   25  developer
2   ravi   30      clerk
3    raj   32   designer

In [63]:
#df.loc[1]
df = df.set_index('name')

In [64]:
df

       age        job
name
shyam   25   develope
ram     25  developer
ravi    30      clerk
raj     32   designer

In [65]:
df.loc['ravi']

age       30
job    clerk
Name: ravi, dtype: object

In [66]:
df.loc['ravi','age']  # 'ravi' is the index row and 'age' is the first column

30

In [69]:
df.at['ravi','age']

30

In [67]:
df.iloc[1]

age           25
job    developer
Name: ram, dtype: object

In [68]:
df.iloc[1,0]    # here 'name' is index row and 'age' is first coulum '0' index

25

In [70]:
df.iat[1,0]

25

In [71]:
# change 'ravi' age = 60
df.at['ravi','age'] = 60

In [72]:
df

       age        job
name
shyam   25   develope
ram     25  developer
ravi    60      clerk
raj     32   designer

In [75]:
# change entire row 
df.loc['ravi'] = [45,'HR']

In [76]:
df

       age        job
name
shyam   25   develope
ram     25  developer
ravi    45         HR
raj     32   designer

In [77]:
# add new rows
df.loc['john'] = [25,'drawer']

In [78]:
df

       age        job
name
shyam   25   develope
ram     25  developer
ravi    45         HR
raj     32   designer
john    25     drawer

In [79]:
# we can use slicing with iloc
df.iloc[0:2]

       age        job
name
shyam   25   develope
ram     25  developer

In [83]:
# all rows and 1st column only
df.iloc[:,1]

name
shyam     develope
ram      developer
ravi            HR
raj       designer
john        drawer
Name: job, dtype: object

In [84]:
# multiply age column with 2
df.age * 2

name
shyam    50
ram      50
ravi     90
raj      64
john     50
Name: age, dtype: int64

In [85]:
# how to do some other logics
def myfunction(x):
    if x % 3 == 0:
        return x**2
    else:
        return x//2

In [86]:
df.age.apply(myfunction)

name
shyam      12
ram        12
ravi     2025
raj        16
john       12
Name: age, dtype: int64

In [88]:
# how to do some other logics
def myfunction2(x):
    if x.endswith('R'):
        return 'no job'
    else:
        return x

In [89]:
df.job.apply(myfunction2)

name
shyam     develope
ram      developer
ravi        no job
raj       designer
john        drawer
Name: job, dtype: object

In [90]:
# we can use lambda function for simple functions
df.age.apply(lambda x: x ** 2 if x % 10 == 0 else x // 2)

name
shyam    12
ram      12
ravi     22
raj      16
john     12
Name: age, dtype: int64

In [95]:
# creating summary column
df['summary'] = df.apply(lambda row : f"Age: {row['age']}, job: {row['job']}", axis=1)

In [96]:
df

       age        job                  summary
name
shyam   25   develope   Age: 25, job: develope
ram     25  developer  Age: 25, job: developer
ravi    45         HR         Age: 45, job: HR
raj     32   designer   Age: 32, job: designer
john    25     drawer     Age: 25, job: drawer